#Дан список чисел. Создать список, в который попадают числа, описывающие возрастающую последовательность.
#Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3] или [1, 7] или [1, 6, 7] и т.д. Порядок элементов менять нельзя


a = [1, 5, 2, 3, 4, 6, 1, 7]
b = []
for i in range((len(a)-2):
    if a[i+2]>a[i+1]>a[i]:
        b.append(a[i])
        b.append(a[i+1])
        b.append(a[i+2])
        #i+=3
    elif a[i+2]<a[i+1]>a[i]:
        b.append(a[i])
        b.append(a[i+2])
        #i+=2
    elif a[i+2]>a[i+1]>a[i]:

           
print(b)